package com.algorithm.shortestParh;

public class shortestPathEx1 {

	//1. 최단경로 알고리즘 : 
	
	/**
	 *  최단경로 알고리즘 : 
	 *  1. 가장 짧은 경로를 찾는 알고리즘 
	 *  - 다양한 경로의 문제 
	 *   1-1) 한 지점에서 다른 한 지점까지의 최단 경로
	 *   1-2) 한 지점에서 다른 모든 지점까지의 최단 경로
	 *   1-3) 모든 지점에서 다른 모든 지점까지의 최단 경로  
	 *   
	 *   다익스트라 알고리즘 : 특정한 노드에서 출발해서 다른 모든 노드로 가는 최단 거리 
	 *   (그리디 알고리즘으로 분류한다, 즉 매 상황에서 가장 적은 비용이 드는 노드를 선택한다,.)
	 *   
	 *   1. 출발 노드를 설정한다.
	 *   2. 최단 거리테이블을 초기화한다.
	 *   3, 방문하지 않은 노드 중에서 가장 최단거리가 짧은노드를 선택한다.
	 *   4. 해당 노드를 거쳐 다른 노드로 가는 비용을 계산하여 최단 거리 테이블을 갱신한다.
	 *   5. 3, 4번을 반복한다. 
	 */
    

	
	public static void main(String[] args) {
		
	}	
}
	
	

